{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "4206990e",
   "metadata": {},
   "source": [
    "<!-- image from image -->\n",
    "![image](images/exemple.png)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "9b7ebb84",
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "from pathlib import Path\n",
    "import pandas as pd\n",
    "import numpy as np\n",
    "from graphdatascience import GraphDataScience\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a3552bd6",
   "metadata": {},
   "source": [
    "connect to Neo4j database and test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "d6005a75",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'2.13.3'"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Neo4j connection details\n",
    "DB_ULR = 'bolt://localhost:7687'\n",
    "DB_USER = 'neo4j' \n",
    "DB_PASS = 'test1234'\n",
    "gds = GraphDataScience(DB_ULR, auth=(DB_USER, DB_PASS))\n",
    "gds.version()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "08d89d29",
   "metadata": {},
   "source": [
    "Test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "92024eef",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>9923</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(n)\n",
       "0      9923"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nodes = gds.run_cypher(\n",
    "    '''\n",
    "    MATCH (n)\n",
    "    RETURN COUNT(n)\n",
    "    '''\n",
    ")\n",
    "nodes.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "450a7ec2",
   "metadata": {},
   "source": [
    "Load data from MovieLens"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "92f1816b",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/qt/7ltb1nw54h14m55jb5k_918w0000gn/T/ipykernel_18379/3257588467.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.\n",
      "  movies = pd.read_csv('ml-1m/movies.dat',sep='::',encoding = 'ISO-8859-1', names = ['MovieID','Title','Genres'])\n",
      "/var/folders/qt/7ltb1nw54h14m55jb5k_918w0000gn/T/ipykernel_18379/3257588467.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.\n",
      "  ratings = pd.read_csv('ml-1m/ratings.dat',sep='::',encoding = 'ISO-8859-1', names = ['UserID','MovieID','Rating','Timestamp'])\n",
      "/var/folders/qt/7ltb1nw54h14m55jb5k_918w0000gn/T/ipykernel_18379/3257588467.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.\n",
      "  users = pd.read_csv('ml-1m/users.dat',sep='::',encoding = 'ISO-8859-1', names = ['UserID','Gender','Age','Occupation','Zip_code'])\n"
     ]
    }
   ],
   "source": [
    "movies = pd.read_csv('ml-1m/movies.dat',sep='::',encoding = 'ISO-8859-1', names = ['MovieID','Title','Genres'])\n",
    "ratings = pd.read_csv('ml-1m/ratings.dat',sep='::',encoding = 'ISO-8859-1', names = ['UserID','MovieID','Rating','Timestamp'])\n",
    "users = pd.read_csv('ml-1m/users.dat',sep='::',encoding = 'ISO-8859-1', names = ['UserID','Gender','Age','Occupation','Zip_code'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "4823bb35",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>MovieID</th>\n",
       "      <th>Title</th>\n",
       "      <th>Genres</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>Toy Story (1995)</td>\n",
       "      <td>Animation|Children's|Comedy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>Jumanji (1995)</td>\n",
       "      <td>Adventure|Children's|Fantasy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3</td>\n",
       "      <td>Grumpier Old Men (1995)</td>\n",
       "      <td>Comedy|Romance</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4</td>\n",
       "      <td>Waiting to Exhale (1995)</td>\n",
       "      <td>Comedy|Drama</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5</td>\n",
       "      <td>Father of the Bride Part II (1995)</td>\n",
       "      <td>Comedy</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   MovieID                               Title                        Genres\n",
       "0        1                    Toy Story (1995)   Animation|Children's|Comedy\n",
       "1        2                      Jumanji (1995)  Adventure|Children's|Fantasy\n",
       "2        3             Grumpier Old Men (1995)                Comedy|Romance\n",
       "3        4            Waiting to Exhale (1995)                  Comedy|Drama\n",
       "4        5  Father of the Bride Part II (1995)                        Comedy"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>UserID</th>\n",
       "      <th>MovieID</th>\n",
       "      <th>Rating</th>\n",
       "      <th>Timestamp</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>1193</td>\n",
       "      <td>5</td>\n",
       "      <td>978300760</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>661</td>\n",
       "      <td>3</td>\n",
       "      <td>978302109</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1</td>\n",
       "      <td>914</td>\n",
       "      <td>3</td>\n",
       "      <td>978301968</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1</td>\n",
       "      <td>3408</td>\n",
       "      <td>4</td>\n",
       "      <td>978300275</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1</td>\n",
       "      <td>2355</td>\n",
       "      <td>5</td>\n",
       "      <td>978824291</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   UserID  MovieID  Rating  Timestamp\n",
       "0       1     1193       5  978300760\n",
       "1       1      661       3  978302109\n",
       "2       1      914       3  978301968\n",
       "3       1     3408       4  978300275\n",
       "4       1     2355       5  978824291"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>UserID</th>\n",
       "      <th>Gender</th>\n",
       "      <th>Age</th>\n",
       "      <th>Occupation</th>\n",
       "      <th>Zip_code</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>F</td>\n",
       "      <td>1</td>\n",
       "      <td>10</td>\n",
       "      <td>48067</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>M</td>\n",
       "      <td>56</td>\n",
       "      <td>16</td>\n",
       "      <td>70072</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3</td>\n",
       "      <td>M</td>\n",
       "      <td>25</td>\n",
       "      <td>15</td>\n",
       "      <td>55117</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4</td>\n",
       "      <td>M</td>\n",
       "      <td>45</td>\n",
       "      <td>7</td>\n",
       "      <td>02460</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5</td>\n",
       "      <td>M</td>\n",
       "      <td>25</td>\n",
       "      <td>20</td>\n",
       "      <td>55455</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   UserID Gender  Age  Occupation Zip_code\n",
       "0       1      F    1          10    48067\n",
       "1       2      M   56          16    70072\n",
       "2       3      M   25          15    55117\n",
       "3       4      M   45           7    02460\n",
       "4       5      M   25          20    55455"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "display(movies.head())\n",
    "display(ratings.head())\n",
    "display(users.head())"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5e6f4b0b",
   "metadata": {},
   "source": [
    "Insert data to graph DB"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "18e1a118",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>custmers_created</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>6040</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   custmers_created\n",
       "0              6040"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# create user nodes\n",
    "def create_user_nodes():\n",
    "    \"\"\"\n",
    "    Crée les nœuds User dans la base de données Neo4j à partir du DataFrame users.\n",
    "    Retourne :\n",
    "        pd.DataFrame : Résultat de la requête de création.\n",
    "    \"\"\"\n",
    "    gds.run_cypher('create constraint if not exists for (n:User) require (n.id) is node key')\n",
    "    create_customer_res = gds.run_cypher(\n",
    "        '''\n",
    "            unwind $data as row\n",
    "            merge (n:User{id: row.UserID})\n",
    "            set n.Gender = row.Gender\n",
    "            set n.Age = row.Age\n",
    "            return count(*) as custmers_created\n",
    "        ''', params={'data': users.to_dict('records')}\n",
    "    )\n",
    "    return create_customer_res\n",
    "\n",
    "create_customer_res = create_user_nodes()\n",
    "create_customer_res.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "7eb04ca4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movies_created</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3883</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   movies_created\n",
       "0            3883"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# create movies nodes\n",
    "def create_movie_nodes():\n",
    "    \"\"\"\n",
    "    Crée les nœuds Movie dans la base de données Neo4j à partir du DataFrame movies.\n",
    "    Retourne :\n",
    "        pd.DataFrame : Résultat de la requête de création.\n",
    "    \"\"\"\n",
    "    gds.run_cypher('create constraint if not exists for (n:Movie) require (n.id) is node key')\n",
    "    create_movie_res = gds.run_cypher(\n",
    "        '''\n",
    "            unwind $data as row\n",
    "            merge (n:Movie{id: row.MovieID})\n",
    "            set n.Title = row.Title\n",
    "            set n.Genres = row.Genres\n",
    "            return count(*) as movies_created\n",
    "        ''', params={'data': movies.to_dict('records')}\n",
    "    )\n",
    "    return create_movie_res\n",
    "\n",
    "create_movie_res = create_movie_nodes()\n",
    "create_movie_res.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "33dc0158",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/opt/anaconda3/lib/python3.12/site-packages/numpy/core/fromnumeric.py:59: FutureWarning: 'DataFrame.swapaxes' is deprecated and will be removed in a future version. Please use 'DataFrame.transpose' instead.\n",
      "  return bound(*args, **kwds)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10\n",
      "20\n",
      "30\n",
      "40\n",
      "50\n",
      "60\n",
      "70\n",
      "80\n",
      "90\n",
      "100\n",
      "110\n",
      "120\n",
      "130\n",
      "140\n",
      "150\n",
      "160\n",
      "170\n",
      "180\n",
      "190\n",
      "200\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>create_rated</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>5001</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   create_rated\n",
       "0          5001"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# create ratings relationship\n",
    "def create_rating_relationship():\n",
    "    \"\"\" \n",
    "    Crée les relations RATED entre les nœuds User et Movie dans la base de données Neo4j à partir du DataFrame ratings.\n",
    "    Retourne :\n",
    "        pd.DataFrame : Résultat de la requête de création.\n",
    "    \"\"\"\n",
    "    i = 1\n",
    "    for chunk in np.array_split(ratings, 200):\n",
    "        if i%10 == 0:\n",
    "            print(i)\n",
    "        create_rated = gds.run_cypher(\n",
    "        '''\n",
    "            unwind $data as row\n",
    "            match (u:User{id:row.UserID}) , (n:Movie{id:row.MovieID})\n",
    "            merge (u)-[r:RATED]->(n)\n",
    "            set r.Rating = row.Rating\n",
    "            return count(*) as create_rated\n",
    "        ''',params = {'data':chunk.to_dict('records')}\n",
    "    )\n",
    "        i = i+1\n",
    "    create_rated.head()\n",
    "\n",
    "create_rating_relationship()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "78023124",
   "metadata": {},
   "source": [
    "<!-- image from image -->\n",
    "![image](images/view_relation.png)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "5ddd193f",
   "metadata": {},
   "outputs": [],
   "source": [
    "# CALL apoc.meta.schema()\n",
    "# CALL .schema.visualization()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "11eefba9",
   "metadata": {},
   "source": [
    "****Recommandation****\n",
    "Recommandation of similar movie\n",
    "A simple way to find similar movie for specific is to count how many paths of the from\n",
    "(movie1)-[]->(user)-[]->(movie2)\n",
    "where movie1 is the movie we want to find similar movie for\n",
    "we order the movie2 based on the number of path that connect the two movie. The idea is that movie will receive\n",
    "excellente rating by the same user"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "67fcd640",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n2.Title</th>\n",
       "      <th>n2.Genres</th>\n",
       "      <th>common_users</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Star Wars: Episode IV - A New Hope (1977)</td>\n",
       "      <td>Action|Adventure|Fantasy|Sci-Fi</td>\n",
       "      <td>401</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Toy Story 2 (1999)</td>\n",
       "      <td>Animation|Children's|Comedy</td>\n",
       "      <td>385</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Raiders of the Lost Ark (1981)</td>\n",
       "      <td>Action|Adventure</td>\n",
       "      <td>373</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Star Wars: Episode V - The Empire Strikes Back...</td>\n",
       "      <td>Action|Adventure|Drama|Sci-Fi|War</td>\n",
       "      <td>346</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Shawshank Redemption, The (1994)</td>\n",
       "      <td>Drama</td>\n",
       "      <td>327</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                            n2.Title  \\\n",
       "0          Star Wars: Episode IV - A New Hope (1977)   \n",
       "1                                 Toy Story 2 (1999)   \n",
       "2                     Raiders of the Lost Ark (1981)   \n",
       "3  Star Wars: Episode V - The Empire Strikes Back...   \n",
       "4                   Shawshank Redemption, The (1994)   \n",
       "\n",
       "                           n2.Genres  common_users  \n",
       "0    Action|Adventure|Fantasy|Sci-Fi           401  \n",
       "1        Animation|Children's|Comedy           385  \n",
       "2                   Action|Adventure           373  \n",
       "3  Action|Adventure|Drama|Sci-Fi|War           346  \n",
       "4                              Drama           327  "
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def find_similar_movies(title, rating=5, top_n=10):\n",
    "    \"\"\"\n",
    "    Trouve les films similaires à un titre donné selon les utilisateurs ayant donné une note spécifique.\n",
    "    Args:\n",
    "        title (str): Le titre du film à rechercher.\n",
    "        rating (int): La note à considérer pour la similarité (par défaut : 5).\n",
    "        top_n (int): Nombre de résultats à retourner (par défaut : 10).\n",
    "    Returns:\n",
    "        pd.DataFrame: DataFrame des films similaires.\n",
    "    \"\"\"\n",
    "    query = '''\n",
    "        MATCH (n1:Movie)-[r1]-(u:User)-[r2]-(n2:Movie)\n",
    "        WHERE n1.Title CONTAINS $title\n",
    "            AND n2.Title<>$title\n",
    "            AND r1.Rating = $rating AND r2.Rating = $rating\n",
    "        RETURN n2.Title, n2.Genres, count(DISTINCT(u)) as common_users\n",
    "        ORDER BY common_users DESC\n",
    "    '''\n",
    "    result = gds.run_cypher(query, params={'title': title, 'rating': rating})\n",
    "    return result.head(top_n)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "173350fa",
   "metadata": {},
   "source": [
    "AND PARAMETRIC QUERY"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "996fde6a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n2.Title</th>\n",
       "      <th>n2.Genres</th>\n",
       "      <th>common_users</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Star Wars: Episode IV - A New Hope (1977)</td>\n",
       "      <td>Action|Adventure|Fantasy|Sci-Fi</td>\n",
       "      <td>401</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Toy Story 2 (1999)</td>\n",
       "      <td>Animation|Children's|Comedy</td>\n",
       "      <td>385</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Raiders of the Lost Ark (1981)</td>\n",
       "      <td>Action|Adventure</td>\n",
       "      <td>373</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Star Wars: Episode V - The Empire Strikes Back...</td>\n",
       "      <td>Action|Adventure|Drama|Sci-Fi|War</td>\n",
       "      <td>346</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Shawshank Redemption, The (1994)</td>\n",
       "      <td>Drama</td>\n",
       "      <td>327</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>American Beauty (1999)</td>\n",
       "      <td>Comedy|Drama</td>\n",
       "      <td>323</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Matrix, The (1999)</td>\n",
       "      <td>Action|Sci-Fi|Thriller</td>\n",
       "      <td>316</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Schindler's List (1993)</td>\n",
       "      <td>Drama|War</td>\n",
       "      <td>311</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Sixth Sense, The (1999)</td>\n",
       "      <td>Thriller</td>\n",
       "      <td>303</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Saving Private Ryan (1998)</td>\n",
       "      <td>Action|Drama|War</td>\n",
       "      <td>300</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                            n2.Title  \\\n",
       "0          Star Wars: Episode IV - A New Hope (1977)   \n",
       "1                                 Toy Story 2 (1999)   \n",
       "2                     Raiders of the Lost Ark (1981)   \n",
       "3  Star Wars: Episode V - The Empire Strikes Back...   \n",
       "4                   Shawshank Redemption, The (1994)   \n",
       "5                             American Beauty (1999)   \n",
       "6                                 Matrix, The (1999)   \n",
       "7                            Schindler's List (1993)   \n",
       "8                            Sixth Sense, The (1999)   \n",
       "9                         Saving Private Ryan (1998)   \n",
       "\n",
       "                           n2.Genres  common_users  \n",
       "0    Action|Adventure|Fantasy|Sci-Fi           401  \n",
       "1        Animation|Children's|Comedy           385  \n",
       "2                   Action|Adventure           373  \n",
       "3  Action|Adventure|Drama|Sci-Fi|War           346  \n",
       "4                              Drama           327  \n",
       "5                       Comedy|Drama           323  \n",
       "6             Action|Sci-Fi|Thriller           316  \n",
       "7                          Drama|War           311  \n",
       "8                           Thriller           303  \n",
       "9                   Action|Drama|War           300  "
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# check the similar movies\n",
    "def find_similar_movies(title, rating=5, top_n=10):\n",
    "    \"\"\"\n",
    "    Trouve les films similaires à un titre donné selon les utilisateurs ayant donné une note spécifique.\n",
    "    Args:\n",
    "        title (str): Le titre du film à rechercher.\n",
    "        rating (int): La note à considérer pour la similarité (par défaut : 5).\n",
    "        top_n (int): Nombre de résultats à retourner (par défaut : 10).\n",
    "    Returns:\n",
    "        pd.DataFrame: DataFrame des films similaires.\n",
    "    \"\"\"\n",
    "    query = '''\n",
    "        MATCH (n1:Movie)-[r1]-(u:User)-[r2]-(n2:Movie)\n",
    "        WHERE n1.Title CONTAINS $title\n",
    "            AND n2.Title<>$title\n",
    "            AND r1.Rating = $rating AND r2.Rating = $rating\n",
    "        RETURN n2.Title, n2.Genres, count(DISTINCT(u)) as common_users\n",
    "        ORDER BY common_users DESC\n",
    "    '''\n",
    "    result = gds.run_cypher(query, params={'title': title, 'rating': rating})\n",
    "    return result.head(top_n)\n",
    "\n",
    "similar_movies = find_similar_movies('Toy Story (1995)', rating=5, top_n=10)\n",
    "similar_movies"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f88c13fb",
   "metadata": {},
   "source": [
    "Use base of recommandatio n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "5880635b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nodeProjection</th>\n",
       "      <th>relationshipProjection</th>\n",
       "      <th>graphName</th>\n",
       "      <th>nodeCount</th>\n",
       "      <th>relationshipCount</th>\n",
       "      <th>projectMillis</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>{'User': {'label': 'User', 'properties': {}}, ...</td>\n",
       "      <td>{'RATED': {'aggregation': 'DEFAULT', 'orientat...</td>\n",
       "      <td>myGraph</td>\n",
       "      <td>9923</td>\n",
       "      <td>1000209</td>\n",
       "      <td>1835</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                      nodeProjection  \\\n",
       "0  {'User': {'label': 'User', 'properties': {}}, ...   \n",
       "\n",
       "                              relationshipProjection graphName  nodeCount  \\\n",
       "0  {'RATED': {'aggregation': 'DEFAULT', 'orientat...   myGraph       9923   \n",
       "\n",
       "   relationshipCount  projectMillis  \n",
       "0            1000209           1835  "
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gds.run_cypher(\"CALL gds.graph.drop('myGraph', false)\")\n",
    "\n",
    "# create a projection\n",
    "create_projection = gds.run_cypher(\n",
    "    '''\n",
    "        CALL gds.graph.project(\n",
    "            'myGraph',\n",
    "            ['User', 'Movie'],\n",
    "            {\n",
    "                RATED: {\n",
    "                    properties: 'Rating'\n",
    "                }\n",
    "            }\n",
    "        );\n",
    "    ''')\n",
    "\n",
    "create_projection.head()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "ba33aad3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>UserID1</th>\n",
       "      <th>UserID2</th>\n",
       "      <th>similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>4725</td>\n",
       "      <td>4808</td>\n",
       "      <td>0.755415</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>4808</td>\n",
       "      <td>4725</td>\n",
       "      <td>0.755415</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1122</td>\n",
       "      <td>2126</td>\n",
       "      <td>0.632000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2126</td>\n",
       "      <td>1122</td>\n",
       "      <td>0.632000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1272</td>\n",
       "      <td>2837</td>\n",
       "      <td>0.601852</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>2837</td>\n",
       "      <td>1272</td>\n",
       "      <td>0.601852</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>4344</td>\n",
       "      <td>4508</td>\n",
       "      <td>0.549313</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>4508</td>\n",
       "      <td>4344</td>\n",
       "      <td>0.549313</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>5281</td>\n",
       "      <td>5287</td>\n",
       "      <td>0.547541</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>5287</td>\n",
       "      <td>5281</td>\n",
       "      <td>0.547541</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   UserID1  UserID2  similarity\n",
       "0     4725     4808    0.755415\n",
       "1     4808     4725    0.755415\n",
       "2     1122     2126    0.632000\n",
       "3     2126     1122    0.632000\n",
       "4     1272     2837    0.601852\n",
       "5     2837     1272    0.601852\n",
       "6     4344     4508    0.549313\n",
       "7     4508     4344    0.549313\n",
       "8     5281     5287    0.547541\n",
       "9     5287     5281    0.547541"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def get_user_similarity(graph_name='myGraph', top_n=10):\n",
    "    \"\"\"\n",
    "    Calcule la similarité entre utilisateurs à partir du graphe projeté.\n",
    "    Args:\n",
    "        graph_name (str): Nom du graphe projeté dans Neo4j.\n",
    "        top_n (int): Nombre de lignes à retourner (par défaut 10).\n",
    "    Returns:\n",
    "        pd.DataFrame: DataFrame des similarités utilisateur-utilisateur.\n",
    "    \"\"\"\n",
    "    user_similarity = gds.run_cypher(\n",
    "        f'''\n",
    "        CALL gds.nodeSimilarity.stream('{graph_name}')\n",
    "        YIELD node1, node2, similarity\n",
    "        RETURN gds.util.asNode(node1).id AS UserID1,\n",
    "               gds.util.asNode(node2).id AS UserID2,\n",
    "               similarity\n",
    "        ORDER BY similarity DESC, UserID1,  UserID2\n",
    "        '''\n",
    "    )\n",
    "    return user_similarity.head(top_n)\n",
    "\n",
    "user_similarity = get_user_similarity(top_n=10)\n",
    "user_similarity\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "7ab59c05",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "u\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/opt/anaconda3/lib/python3.12/site-packages/graphdatascience/query_runner/neo4j_query_runner.py:277: RuntimeWarning: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: rating)\n",
      "  warnings.warn(warning)\n"
     ]
    }
   ],
   "source": [
    "# afficher des utilisateurs centraux\n",
    "central_users = gds.run_cypher(\"MATCH (u:User) RETURN u ORDER BY u.rating DESC LIMIT 10\")\n",
    "for user in central_users:\n",
    "    print(user)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "35b914c1",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/opt/anaconda3/lib/python3.12/site-packages/numpy/core/fromnumeric.py:59: FutureWarning: 'DataFrame.swapaxes' is deprecated and will be removed in a future version. Please use 'DataFrame.transpose' instead.\n",
      "  return bound(*args, **kwds)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>create_rated</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3179</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   create_rated\n",
       "0          3179"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# create similar relationship\n",
    "i = 1\n",
    "for chunk in np.array_split(user_similarity.query('UserID1 > UserID2'), 10):\n",
    "    if i%10 == 0:\n",
    "        print(i)\n",
    "    create_rated = gds.run_cypher(\n",
    "        '''\n",
    "            unwind $data as row\n",
    "            match (u1:User{id:row.UserID1}) , (u2:User{id:row.UserID2})\n",
    "            merge (u1)-[r:SIMILAR]->(u2)\n",
    "            set r.similarity = row.similarity\n",
    "            return count(*) as create_rated\n",
    "        ''',params = {'data':chunk.to_dict('records')}\n",
    "    )\n",
    "    i = i+1\n",
    "create_rated.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "dd7174ec",
   "metadata": {},
   "source": [
    "<!-- image from image -->\n",
    "![image](images/view_relation2.png)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "1ff238bb",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>m.Title</th>\n",
       "      <th>m.Genres</th>\n",
       "      <th>score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Schindler's List (1993)</td>\n",
       "      <td>Drama|War</td>\n",
       "      <td>6.864803</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Toy Story (1995)</td>\n",
       "      <td>Animation|Children's|Comedy</td>\n",
       "      <td>6.497486</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>October Sky (1999)</td>\n",
       "      <td>Drama</td>\n",
       "      <td>6.390129</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Almost Famous (2000)</td>\n",
       "      <td>Comedy|Drama</td>\n",
       "      <td>6.389066</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Bulworth (1998)</td>\n",
       "      <td>Comedy</td>\n",
       "      <td>6.283263</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Boys Don't Cry (1999)</td>\n",
       "      <td>Drama</td>\n",
       "      <td>6.259083</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Apollo 13 (1995)</td>\n",
       "      <td>Drama</td>\n",
       "      <td>6.209804</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Boogie Nights (1997)</td>\n",
       "      <td>Drama</td>\n",
       "      <td>6.169459</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>GoodFellas (1990)</td>\n",
       "      <td>Crime|Drama</td>\n",
       "      <td>6.156693</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Simple Plan, A (1998)</td>\n",
       "      <td>Crime|Thriller</td>\n",
       "      <td>6.120458</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Election (1999)</td>\n",
       "      <td>Comedy</td>\n",
       "      <td>6.064834</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Pleasantville (1998)</td>\n",
       "      <td>Comedy</td>\n",
       "      <td>6.058537</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Searching for Bobby Fischer (1993)</td>\n",
       "      <td>Drama</td>\n",
       "      <td>6.057292</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Grosse Pointe Blank (1997)</td>\n",
       "      <td>Comedy|Crime</td>\n",
       "      <td>6.022580</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Fantasia 2000 (1999)</td>\n",
       "      <td>Animation|Children's|Musical</td>\n",
       "      <td>5.976714</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Full Monty, The (1997)</td>\n",
       "      <td>Comedy</td>\n",
       "      <td>5.946039</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Titanic (1997)</td>\n",
       "      <td>Drama|Romance</td>\n",
       "      <td>5.930543</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>American History X (1998)</td>\n",
       "      <td>Drama</td>\n",
       "      <td>5.866842</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Player, The (1992)</td>\n",
       "      <td>Comedy|Drama</td>\n",
       "      <td>5.858125</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Fugitive, The (1993)</td>\n",
       "      <td>Action|Thriller</td>\n",
       "      <td>5.802658</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Three Kings (1999)</td>\n",
       "      <td>Drama|War</td>\n",
       "      <td>5.779460</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Primal Fear (1996)</td>\n",
       "      <td>Drama|Thriller</td>\n",
       "      <td>5.776211</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>My Cousin Vinny (1992)</td>\n",
       "      <td>Comedy</td>\n",
       "      <td>5.770870</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Little Mermaid, The (1989)</td>\n",
       "      <td>Animation|Children's|Comedy|Musical|Romance</td>\n",
       "      <td>5.765569</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Terminator, The (1984)</td>\n",
       "      <td>Action|Sci-Fi|Thriller</td>\n",
       "      <td>5.727543</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Umbrellas of Cherbourg, The (Parapluies de Che...</td>\n",
       "      <td>Drama|Musical</td>\n",
       "      <td>5.693147</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>When Harry Met Sally... (1989)</td>\n",
       "      <td>Comedy|Romance</td>\n",
       "      <td>5.693147</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Wizard of Oz, The (1939)</td>\n",
       "      <td>Adventure|Children's|Drama|Musical</td>\n",
       "      <td>5.693147</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Dangerous Beauty (1998)</td>\n",
       "      <td>Drama</td>\n",
       "      <td>5.693147</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Ever After: A Cinderella Story (1998)</td>\n",
       "      <td>Drama|Romance</td>\n",
       "      <td>5.663173</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>Mask, The (1994)</td>\n",
       "      <td>Comedy|Crime|Fantasy</td>\n",
       "      <td>5.661779</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                              m.Title  \\\n",
       "0                             Schindler's List (1993)   \n",
       "1                                    Toy Story (1995)   \n",
       "2                                  October Sky (1999)   \n",
       "3                                Almost Famous (2000)   \n",
       "4                                     Bulworth (1998)   \n",
       "5                               Boys Don't Cry (1999)   \n",
       "6                                    Apollo 13 (1995)   \n",
       "7                                Boogie Nights (1997)   \n",
       "8                                   GoodFellas (1990)   \n",
       "9                               Simple Plan, A (1998)   \n",
       "10                                    Election (1999)   \n",
       "11                               Pleasantville (1998)   \n",
       "12                 Searching for Bobby Fischer (1993)   \n",
       "13                         Grosse Pointe Blank (1997)   \n",
       "14                               Fantasia 2000 (1999)   \n",
       "15                             Full Monty, The (1997)   \n",
       "16                                     Titanic (1997)   \n",
       "17                          American History X (1998)   \n",
       "18                                 Player, The (1992)   \n",
       "19                               Fugitive, The (1993)   \n",
       "20                                 Three Kings (1999)   \n",
       "21                                 Primal Fear (1996)   \n",
       "22                             My Cousin Vinny (1992)   \n",
       "23                         Little Mermaid, The (1989)   \n",
       "24                             Terminator, The (1984)   \n",
       "25  Umbrellas of Cherbourg, The (Parapluies de Che...   \n",
       "26                     When Harry Met Sally... (1989)   \n",
       "27                           Wizard of Oz, The (1939)   \n",
       "28                            Dangerous Beauty (1998)   \n",
       "29              Ever After: A Cinderella Story (1998)   \n",
       "30                                   Mask, The (1994)   \n",
       "\n",
       "                                       m.Genres     score  \n",
       "0                                     Drama|War  6.864803  \n",
       "1                   Animation|Children's|Comedy  6.497486  \n",
       "2                                         Drama  6.390129  \n",
       "3                                  Comedy|Drama  6.389066  \n",
       "4                                        Comedy  6.283263  \n",
       "5                                         Drama  6.259083  \n",
       "6                                         Drama  6.209804  \n",
       "7                                         Drama  6.169459  \n",
       "8                                   Crime|Drama  6.156693  \n",
       "9                                Crime|Thriller  6.120458  \n",
       "10                                       Comedy  6.064834  \n",
       "11                                       Comedy  6.058537  \n",
       "12                                        Drama  6.057292  \n",
       "13                                 Comedy|Crime  6.022580  \n",
       "14                 Animation|Children's|Musical  5.976714  \n",
       "15                                       Comedy  5.946039  \n",
       "16                                Drama|Romance  5.930543  \n",
       "17                                        Drama  5.866842  \n",
       "18                                 Comedy|Drama  5.858125  \n",
       "19                              Action|Thriller  5.802658  \n",
       "20                                    Drama|War  5.779460  \n",
       "21                               Drama|Thriller  5.776211  \n",
       "22                                       Comedy  5.770870  \n",
       "23  Animation|Children's|Comedy|Musical|Romance  5.765569  \n",
       "24                       Action|Sci-Fi|Thriller  5.727543  \n",
       "25                                Drama|Musical  5.693147  \n",
       "26                               Comedy|Romance  5.693147  \n",
       "27           Adventure|Children's|Drama|Musical  5.693147  \n",
       "28                                        Drama  5.693147  \n",
       "29                                Drama|Romance  5.663173  \n",
       "30                         Comedy|Crime|Fantasy  5.661779  "
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# check the similar movies\n",
    "def recommend_movies_for_user(user_id, top_n=31):\n",
    "    \"\"\"\n",
    "    Recommande des films pour un utilisateur en se basant sur les notes des utilisateurs similaires.\n",
    "    Args:\n",
    "        user_id (int): L'identifiant de l'utilisateur pour lequel recommander des films.\n",
    "        top_n (int): Nombre de recommandations à retourner.\n",
    "    Returns:\n",
    "        pd.DataFrame: DataFrame des films recommandés.\n",
    "    \"\"\"\n",
    "    query = '''\n",
    "        MATCH (u1:User)-[r1:SIMILAR]-(u2)-[r2:RATED]-(m:Movie)\n",
    "        WHERE id(u1) = $id\n",
    "           AND NOT ((u1)-[]-(m))\n",
    "        RETURN m.Title, m.Genres, Sum(r1.similarity * r2.Rating) / Sum(r1.similarity)+ log(count(r2)) as score\n",
    "        ORDER BY score DESC\n",
    "    '''\n",
    "    result = gds.run_cypher(query, params={'id': user_id})\n",
    "    return result.head(top_n)\n",
    "\n",
    "similar_movies_for_user = recommend_movies_for_user(4725, top_n=31)\n",
    "similar_movies_for_user"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "4217d284",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>m.Title</th>\n",
       "      <th>m.Genres</th>\n",
       "      <th>rating</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Twelve Monkeys (1995)</td>\n",
       "      <td>Drama|Sci-Fi</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Babe (1995)</td>\n",
       "      <td>Children's|Comedy|Drama</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Dead Man Walking (1995)</td>\n",
       "      <td>Drama</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Braveheart (1995)</td>\n",
       "      <td>Action|Drama|War</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Little Women (1994)</td>\n",
       "      <td>Drama</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Little Princess, A (1995)</td>\n",
       "      <td>Children's|Drama</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Pulp Fiction (1994)</td>\n",
       "      <td>Crime|Drama</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Tank Girl (1995)</td>\n",
       "      <td>Action|Comedy|Musical|Sci-Fi</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Corrina, Corrina (1994)</td>\n",
       "      <td>Comedy|Drama|Romance</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Forrest Gump (1994)</td>\n",
       "      <td>Comedy|Romance|War</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Lion King, The (1994)</td>\n",
       "      <td>Animation|Children's|Musical</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Sleepless in Seattle (1993)</td>\n",
       "      <td>Comedy|Romance</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Dances with Wolves (1990)</td>\n",
       "      <td>Adventure|Drama|Western</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Beauty and the Beast (1991)</td>\n",
       "      <td>Animation|Children's|Musical</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Wallace &amp; Gromit: The Best of Aardman Animatio...</td>\n",
       "      <td>Animation</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                              m.Title  \\\n",
       "0                               Twelve Monkeys (1995)   \n",
       "1                                         Babe (1995)   \n",
       "2                             Dead Man Walking (1995)   \n",
       "3                                   Braveheart (1995)   \n",
       "4                                 Little Women (1994)   \n",
       "5                           Little Princess, A (1995)   \n",
       "6                                 Pulp Fiction (1994)   \n",
       "7                                    Tank Girl (1995)   \n",
       "8                             Corrina, Corrina (1994)   \n",
       "9                                 Forrest Gump (1994)   \n",
       "10                              Lion King, The (1994)   \n",
       "11                        Sleepless in Seattle (1993)   \n",
       "12                          Dances with Wolves (1990)   \n",
       "13                        Beauty and the Beast (1991)   \n",
       "14  Wallace & Gromit: The Best of Aardman Animatio...   \n",
       "\n",
       "                        m.Genres  rating  \n",
       "0                   Drama|Sci-Fi       5  \n",
       "1        Children's|Comedy|Drama       5  \n",
       "2                          Drama       5  \n",
       "3               Action|Drama|War       5  \n",
       "4                          Drama       5  \n",
       "5               Children's|Drama       5  \n",
       "6                    Crime|Drama       5  \n",
       "7   Action|Comedy|Musical|Sci-Fi       5  \n",
       "8           Comedy|Drama|Romance       5  \n",
       "9             Comedy|Romance|War       5  \n",
       "10  Animation|Children's|Musical       5  \n",
       "11                Comedy|Romance       5  \n",
       "12       Adventure|Drama|Western       5  \n",
       "13  Animation|Children's|Musical       5  \n",
       "14                     Animation       5  "
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# cherk actual movies\n",
    "def get_actual_movies_for_user(user_id, top_n=10):\n",
    "    \"\"\"\n",
    "    Récupère les films réellement notés par un utilisateur, triés par note décroissante.\n",
    "    Args:\n",
    "        user_id (int): L'identifiant de l'utilisateur.\n",
    "        top_n (int): Nombre de films les mieux notés à retourner.\n",
    "    Returns:\n",
    "        pd.DataFrame: DataFrame des films notés par l'utilisateur.\n",
    "    \"\"\"\n",
    "    result = gds.run_cypher(\n",
    "        '''\n",
    "        MATCH (u1:User)-[r:RATED]-(m:Movie)\n",
    "        WHERE id(u1) = $id\n",
    "        RETURN m.Title, m.Genres, r.Rating as rating\n",
    "        ORDER BY rating DESC\n",
    "        ''', params={'id': user_id}\n",
    "    )\n",
    "    return result.head(top_n)\n",
    "\n",
    "actual_movies = get_actual_movies_for_user(4725, top_n=15)\n",
    "actual_movies"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a9551876",
   "metadata": {},
   "source": [
    "***Recommendation par rapport au genre***\n",
    "\n",
    "  Recommande des films à un utilisateur basé sur ses genres préférés.\n",
    "\n",
    "    Params :\n",
    "    - user_id : ID de l'utilisateur dans Neo4j.\n",
    "    - gds : Instance GDS connectée.\n",
    "    - top_genres : nombre de genres favoris à considérer.\n",
    "    - top_recommendations : nombre de films recommandés à retourner.\n",
    "\n",
    "    Retour :\n",
    "    - DataFrame des recommandations.\n",
    "    \"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "a7761f63",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "                             Films_recommander  \\\n",
      "0                       $1,000,000 Duck (1971)   \n",
      "1                           'burbs, The (1989)   \n",
      "2                              20 Dates (1998)   \n",
      "3          20,000 Leagues Under the Sea (1954)   \n",
      "4                        200 Cigarettes (1999)   \n",
      "5               24 7: Twenty Four Seven (1997)   \n",
      "6                               28 Days (2000)   \n",
      "7  3 Ninjas: High Noon On Mega Mountain (1998)   \n",
      "8                             3 Strikes (2000)   \n",
      "9                           8 1/2 Women (1999)   \n",
      "\n",
      "                    Genres_recommander  \n",
      "0                    Children's|Comedy  \n",
      "1                               Comedy  \n",
      "2                               Comedy  \n",
      "3  Adventure|Children's|Fantasy|Sci-Fi  \n",
      "4                         Comedy|Drama  \n",
      "5                         Comedy|Drama  \n",
      "6                               Comedy  \n",
      "7                    Action|Children's  \n",
      "8                               Comedy  \n",
      "9                               Comedy  \n"
     ]
    }
   ],
   "source": [
    "def recommend_by_genre(user_id, top_genres=3, top_recommendations=10):\n",
    "    \"\"\" \n",
    "    Recommande des films à un utilisateur en se basant sur les genres des films qu'il a notés positivement.\n",
    "    Args:\n",
    "        user_id (int): L'identifiant de l'utilisateur pour lequel recommander des films.\n",
    "        top_genres (int): Nombre de genres à considérer pour la recommandation.\n",
    "        top_recommendations (int): Nombre de recommandations à retourner.\n",
    "        Returns:\n",
    "        pd.DataFrame: DataFrame des films recommandés.\n",
    "    \"\"\"\n",
    "    query = f\"\"\"\n",
    "    MATCH (u:User {{id: $id}})-[r:RATED]->(m:Movie)\n",
    "    WHERE r.Rating >= 4\n",
    "    WITH u, split(m.Genres, '|') AS genres\n",
    "    UNWIND genres AS genre\n",
    "    WITH u, genre, count(*) AS genreScore\n",
    "    ORDER BY genreScore DESC\n",
    "    WITH u, collect(genre)[..{top_genres}] AS topGenres\n",
    "\n",
    "    MATCH (rec:Movie)\n",
    "    WHERE any(g IN split(rec.Genres, '|') WHERE g IN topGenres)\n",
    "      AND NOT EXISTS {{\n",
    "        MATCH (u)-[:RATED]->(rec)\n",
    "      }}\n",
    "\n",
    "    RETURN DISTINCT rec.Title AS Films_recommander, rec.Genres AS Genres_recommander\n",
    "    ORDER BY rec.Title\n",
    "    LIMIT {top_recommendations}\n",
    "    \"\"\"\n",
    "    try:\n",
    "        result = gds.run_cypher(query, params={\"id\": user_id})\n",
    "        return result\n",
    "    except Exception as e:\n",
    "        print(f\"Erreur pendant la recommandation : {e}\")\n",
    "        return pd.DataFrame()\n",
    "\n",
    "recommendations = recommend_by_genre(user_id=75)\n",
    "print(recommendations)\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
