{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "a51abb39",
   "metadata": {},
   "source": [
    "<!-- image from image -->\n",
    "![image](images/exemple.png)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "db082771",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import numpy as np\n",
    "from graphdatascience import GraphDataScience"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "83fdd860",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'2.13.3'"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Neo4j Connection details\n",
    "DB_ULR = 'bolt://localhost:7687'\n",
    "DB_USER = 'neo4j' \n",
    "DB_PASS = 'test1234'\n",
    "gds = GraphDataScience(DB_ULR, auth=(DB_USER, DB_PASS))\n",
    "gds.version()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "efa86faa",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>224964</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(n)\n",
       "0    224964"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nodes = gds.run_cypher('''\n",
    "    MATCH (n)\n",
    "    RETURN COUNT(n)\n",
    "''') \n",
    "nodes.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "f436f9b3",
   "metadata": {},
   "outputs": [],
   "source": [
    "movies = pd.read_csv('datasets/movies.dat', sep='::', encoding=\"ISO-8859-1\", names=['MovieID','Title','Genres', 'Actors', 'Realizations', 'Date'], engine='python')\n",
    "ratings = pd.read_csv('datasets/ratings.dat', sep='::', encoding=\"ISO-8859-1\",names=['UserID','MovieID','Rating','Timestamp'], engine='python')\n",
    "users = pd.read_csv('datasets/users.dat', sep='::', encoding=\"ISO-8859-1\",names=['UserID','Name','Gender','Age','Occupation','Zip_code'], engine='python')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "55f07701",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "************** Les films *******\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>MovieID</th>\n",
       "      <th>Title</th>\n",
       "      <th>Genres</th>\n",
       "      <th>Actors</th>\n",
       "      <th>Realizations</th>\n",
       "      <th>Date</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>Toy Story</td>\n",
       "      <td>Adventure|Animation|Children|Comedy|Fantasy</td>\n",
       "      <td>Tina Stewart|Jessica Smith</td>\n",
       "      <td>Jeremy Hendricks|Sonya Edwards</td>\n",
       "      <td>1995.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>Jumanji</td>\n",
       "      <td>Adventure|Children|Fantasy</td>\n",
       "      <td>Richard Sanchez|David Walker|Carol Rodriguez|J...</td>\n",
       "      <td>Edward Williams|Keith Hudson</td>\n",
       "      <td>1995.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3</td>\n",
       "      <td>Grumpier Old Men</td>\n",
       "      <td>Comedy|Romance</td>\n",
       "      <td>Nicholas Ramsey|Donna Williams|David Huerta|Ch...</td>\n",
       "      <td>Kyle Luna|Daniel Gonzalez</td>\n",
       "      <td>1995.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4</td>\n",
       "      <td>Waiting to Exhale</td>\n",
       "      <td>Comedy|Drama|Romance</td>\n",
       "      <td>Curtis Wright</td>\n",
       "      <td>Derrick Campbell</td>\n",
       "      <td>1995.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5</td>\n",
       "      <td>Father of the Bride Part II</td>\n",
       "      <td>Comedy</td>\n",
       "      <td>David Rogers|Stanley Galloway</td>\n",
       "      <td>Howard Martinez</td>\n",
       "      <td>1995.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   MovieID                        Title  \\\n",
       "0        1                    Toy Story   \n",
       "1        2                      Jumanji   \n",
       "2        3             Grumpier Old Men   \n",
       "3        4            Waiting to Exhale   \n",
       "4        5  Father of the Bride Part II   \n",
       "\n",
       "                                        Genres  \\\n",
       "0  Adventure|Animation|Children|Comedy|Fantasy   \n",
       "1                   Adventure|Children|Fantasy   \n",
       "2                               Comedy|Romance   \n",
       "3                         Comedy|Drama|Romance   \n",
       "4                                       Comedy   \n",
       "\n",
       "                                              Actors  \\\n",
       "0                         Tina Stewart|Jessica Smith   \n",
       "1  Richard Sanchez|David Walker|Carol Rodriguez|J...   \n",
       "2  Nicholas Ramsey|Donna Williams|David Huerta|Ch...   \n",
       "3                                      Curtis Wright   \n",
       "4                      David Rogers|Stanley Galloway   \n",
       "\n",
       "                     Realizations    Date  \n",
       "0  Jeremy Hendricks|Sonya Edwards  1995.0  \n",
       "1    Edward Williams|Keith Hudson  1995.0  \n",
       "2       Kyle Luna|Daniel Gonzalez  1995.0  \n",
       "3                Derrick Campbell  1995.0  \n",
       "4                 Howard Martinez  1995.0  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "************** Les utilisateurs *******\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>UserID</th>\n",
       "      <th>Name</th>\n",
       "      <th>Gender</th>\n",
       "      <th>Age</th>\n",
       "      <th>Occupation</th>\n",
       "      <th>Zip_code</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>Mary Campbell</td>\n",
       "      <td>F</td>\n",
       "      <td>35</td>\n",
       "      <td>27</td>\n",
       "      <td>92606</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>Larry Shaw</td>\n",
       "      <td>M</td>\n",
       "      <td>15</td>\n",
       "      <td>22</td>\n",
       "      <td>6265</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3</td>\n",
       "      <td>Suzanne Quinn</td>\n",
       "      <td>F</td>\n",
       "      <td>27</td>\n",
       "      <td>27</td>\n",
       "      <td>54865</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4</td>\n",
       "      <td>Monique Hughes</td>\n",
       "      <td>F</td>\n",
       "      <td>62</td>\n",
       "      <td>2</td>\n",
       "      <td>1871</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5</td>\n",
       "      <td>Justin Stone</td>\n",
       "      <td>M</td>\n",
       "      <td>47</td>\n",
       "      <td>21</td>\n",
       "      <td>99193</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   UserID            Name Gender  Age  Occupation  Zip_code\n",
       "0       1   Mary Campbell      F   35          27     92606\n",
       "1       2      Larry Shaw      M   15          22      6265\n",
       "2       3   Suzanne Quinn      F   27          27     54865\n",
       "3       4  Monique Hughes      F   62           2      1871\n",
       "4       5    Justin Stone      M   47          21     99193"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "************** Les notes *******\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>UserID</th>\n",
       "      <th>MovieID</th>\n",
       "      <th>Rating</th>\n",
       "      <th>Timestamp</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>296</td>\n",
       "      <td>5.0</td>\n",
       "      <td>1147880044</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>306</td>\n",
       "      <td>3.5</td>\n",
       "      <td>1147868817</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1</td>\n",
       "      <td>307</td>\n",
       "      <td>5.0</td>\n",
       "      <td>1147868828</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1</td>\n",
       "      <td>665</td>\n",
       "      <td>5.0</td>\n",
       "      <td>1147878820</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1</td>\n",
       "      <td>899</td>\n",
       "      <td>3.5</td>\n",
       "      <td>1147868510</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   UserID  MovieID  Rating   Timestamp\n",
       "0       1      296     5.0  1147880044\n",
       "1       1      306     3.5  1147868817\n",
       "2       1      307     5.0  1147868828\n",
       "3       1      665     5.0  1147878820\n",
       "4       1      899     3.5  1147868510"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "print(\"************** Les films *******\")\n",
    "display(movies.head())\n",
    "print(\"************** Les utilisateurs *******\")\n",
    "display(users.head())\n",
    "print(\"************** Les notes *******\")\n",
    "display(ratings.head())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "b931cb60",
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_user_nodes(gds, users_df):\n",
    "    '''\n",
    "    Crée des noeuds d'utilisateur dans la base de données Neo4j.\n",
    "        :param gds: Instance de GraphDataScience\n",
    "        :param users_df: DataFrame contenant les informations des utilisateurs\n",
    "        :return: Résultat de la requête Cypher\n",
    "    '''\n",
    "    # Ajouter la contrainte (si elle n'existe pas encore)\n",
    "    gds.run_cypher('''\n",
    "        CREATE CONSTRAINT IF NOT EXISTS \n",
    "        FOR (n:User) \n",
    "        REQUIRE n.id IS NODE KEY\n",
    "    ''')\n",
    "\n",
    "    # Inserer les Users\n",
    "    result = gds.run_cypher('''\n",
    "        UNWIND $data AS row\n",
    "        MERGE (u:User {id: row.UserID})\n",
    "        SET u.gender = row.Gender,\n",
    "            u.age = row.Age\n",
    "        RETURN count(*) AS users_created\n",
    "    ''', params={'data': users_df.to_dict('records')})\n",
    "\n",
    "    return result\n",
    "\n",
    "\n",
    "def create_movie_nodes(gds, movies_df):\n",
    "    '''\n",
    "    Crée des noeuds de film dans la base de données Neo4j.\n",
    "        :param gds: Instance de GraphDataScience\n",
    "        :param movies_df: DataFrame contenant les informations des films\n",
    "        :return: Résultat de la requête Cypher\n",
    "    '''\n",
    "    # Ajouter la contrainte (si elle n'existe pas encore)\n",
    "    gds.run_cypher('''\n",
    "        CREATE CONSTRAINT IF NOT EXISTS \n",
    "        FOR (n:Movie) \n",
    "        REQUIRE n.id IS NODE KEY\n",
    "    ''')\n",
    "\n",
    "    # Inserer les Movies\n",
    "    result = gds.run_cypher('''\n",
    "        UNWIND $data AS row\n",
    "        MERGE (m:Movie {id: row.MovieID})\n",
    "        SET m.title = row.Title,\n",
    "            m.genres = row.Genres\n",
    "        RETURN count(*) AS movies_created\n",
    "    ''', params={'data': movies_df.to_dict('records')})\n",
    "\n",
    "    return result\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "9a03b1df",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "   users_created\n",
      "0         162541\n",
      "   movies_created\n",
      "0           62423\n"
     ]
    }
   ],
   "source": [
    "# Créer les utilisateurs\n",
    "res_users = create_user_nodes(gds, users)\n",
    "print(res_users)\n",
    "\n",
    "# Créer les films\n",
    "res_movies = create_movie_nodes(gds, movies)\n",
    "print(res_movies)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "724f80ec",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count(u)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>162541</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   count(u)\n",
       "0    162541"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nodes = gds.run_cypher('''\n",
    "    MATCH (u:User) RETURN count(u);\n",
    "''') \n",
    "nodes.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "96631451",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count(m)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>62423</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   count(m)\n",
       "0     62423"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nodes = gds.run_cypher('''\n",
    "    MATCH (m:Movie) RETURN count(m);\n",
    "''')\n",
    "nodes.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "5ff3cb55",
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_rated_relationships(gds, ratings_df, chunk_size=200):\n",
    "    i = 1\n",
    "    for chunk in np.array_split(ratings_df, chunk_size):\n",
    "        print(f\"Chunk {i}/{chunk_size}\")\n",
    "        result = gds.run_cypher('''\n",
    "            UNWIND $data AS row\n",
    "            MATCH (u:User {id: row.UserID}), (m:Movie {id: row.MovieID})\n",
    "            MERGE (u)-[r:RATED]->(m)\n",
    "            SET r.rating = row.Rating\n",
    "            RETURN count(*) AS created\n",
    "        ''', params={'data': chunk.to_dict('records')})\n",
    "        print(result.head())\n",
    "        i += 1\n",
    "    return result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "f28dba81",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/opt/anaconda3/lib/python3.12/site-packages/numpy/core/fromnumeric.py:59: FutureWarning: 'DataFrame.swapaxes' is deprecated and will be removed in a future version. Please use 'DataFrame.transpose' instead.\n",
      "  return bound(*args, **kwds)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Chunk 1/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 2/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 3/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 4/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 5/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 6/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 7/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 8/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 9/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 10/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 11/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 12/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 13/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 14/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 15/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 16/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 17/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 18/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 19/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 20/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 21/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 22/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 23/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 24/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 25/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 26/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 27/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 28/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 29/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 30/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 31/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 32/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 33/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 34/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 35/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 36/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 37/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 38/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 39/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 40/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 41/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 42/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 43/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 44/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 45/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 46/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 47/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 48/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 49/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 50/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 51/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 52/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 53/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 54/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 55/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 56/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 57/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 58/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 59/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 60/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 61/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 62/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 63/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 64/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 65/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 66/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 67/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 68/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 69/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 70/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 71/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 72/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 73/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 74/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 75/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 76/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 77/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 78/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 79/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 80/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 81/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 82/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 83/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 84/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 85/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 86/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 87/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 88/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 89/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 90/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 91/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 92/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 93/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 94/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 95/200\n",
      "   created\n",
      "0   125001\n",
      "Chunk 96/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 97/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 98/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 99/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 100/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 101/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 102/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 103/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 104/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 105/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 106/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 107/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 108/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 109/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 110/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 111/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 112/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 113/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 114/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 115/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 116/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 117/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 118/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 119/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 120/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 121/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 122/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 123/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 124/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 125/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 126/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 127/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 128/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 129/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 130/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 131/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 132/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 133/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 134/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 135/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 136/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 137/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 138/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 139/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 140/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 141/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 142/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 143/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 144/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 145/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 146/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 147/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 148/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 149/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 150/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 151/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 152/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 153/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 154/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 155/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 156/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 157/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 158/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 159/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 160/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 161/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 162/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 163/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 164/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 165/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 166/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 167/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 168/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 169/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 170/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 171/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 172/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 173/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 174/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 175/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 176/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 177/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 178/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 179/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 180/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 181/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 182/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 183/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 184/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 185/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 186/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 187/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 188/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 189/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 190/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 191/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 192/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 193/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 194/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 195/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 196/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 197/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 198/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 199/200\n",
      "   created\n",
      "0   125000\n",
      "Chunk 200/200\n",
      "   created\n",
      "0   125000\n",
      "   created\n",
      "0   125000\n"
     ]
    }
   ],
   "source": [
    "# Créer les relations RATED\n",
    "res_rated = create_rated_relationships(gds, ratings)\n",
    "print(res_rated)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "b24912c9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count(r)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>25000095</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   count(r)\n",
       "0  25000095"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nodes = gds.run_cypher('''\n",
    "    MATCH (u:User)-[r:RATED]->(m:Movie) RETURN count(r);\n",
    "''')\n",
    "nodes.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "eb0215bb",
   "metadata": {},
   "source": [
    "<!-- image from image -->\n",
    "![image](images/view_relation.png)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "be41270c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>title</th>\n",
       "      <th>genres</th>\n",
       "      <th>common_users</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Fight Club</td>\n",
       "      <td>Action|Crime|Drama|Thriller</td>\n",
       "      <td>109</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Matrix The</td>\n",
       "      <td>Action|Sci-Fi|Thriller</td>\n",
       "      <td>107</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Dark Knight The</td>\n",
       "      <td>Action|Crime|Drama|IMAX</td>\n",
       "      <td>102</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Inception</td>\n",
       "      <td>Action|Crime|Drama|Mystery|Sci-Fi|Thriller|IMAX</td>\n",
       "      <td>96</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Sixth Sense The</td>\n",
       "      <td>Drama|Horror|Mystery</td>\n",
       "      <td>94</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             title                                           genres  \\\n",
       "0       Fight Club                      Action|Crime|Drama|Thriller   \n",
       "1       Matrix The                           Action|Sci-Fi|Thriller   \n",
       "2  Dark Knight The                          Action|Crime|Drama|IMAX   \n",
       "3        Inception  Action|Crime|Drama|Mystery|Sci-Fi|Thriller|IMAX   \n",
       "4  Sixth Sense The                             Drama|Horror|Mystery   \n",
       "\n",
       "   common_users  \n",
       "0           109  \n",
       "1           107  \n",
       "2           102  \n",
       "3            96  \n",
       "4            94  "
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def get_similar_movies(title):\n",
    "    \"\"\"\n",
    "    Récupère la liste des films similaires à un film donné en fonction des utilisateurs \n",
    "    ayant noté les deux films avec la note maximale (5).\n",
    "\n",
    "    Cette fonction interroge la base de données Neo4j pour trouver les films qui partagent \n",
    "    des utilisateurs en commun ayant attribué une note de 5 à ces films et au film cible.\n",
    "\n",
    "    Args:\n",
    "        title (str): Le titre exact du film pour lequel trouver des films similaires.\n",
    "\n",
    "    Returns:\n",
    "        pd.DataFrame: Un DataFrame contenant :\n",
    "            - title (str): Le titre des films similaires.\n",
    "            - genres (str): Les genres des films similaires.\n",
    "            - common_users (int): Le nombre d'utilisateurs ayant noté les deux films avec la note 5.\n",
    "    \"\"\"\n",
    "    \n",
    "    query = '''\n",
    "    MATCH (m1:Movie)-[r1:RATED]-(u:User)-[r2:RATED]-(m2:Movie)\n",
    "    WHERE m1.title = $title\n",
    "      AND m2.title <> $title\n",
    "      AND r1.rating = 5 \n",
    "      AND r2.rating = 5\n",
    "    RETURN m2.title AS title, m2.genres AS genres, count(DISTINCT u) AS common_users\n",
    "    ORDER BY common_users DESC\n",
    "    '''\n",
    "\n",
    "    result = gds.run_cypher(query, params={'title': title})\n",
    "    return result\n",
    "\n",
    "\n",
    "similar_movies = get_similar_movies('1408')\n",
    "similar_movies.head()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "e870fd31",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>title</th>\n",
       "      <th>genres</th>\n",
       "      <th>common_users</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Matrix The</td>\n",
       "      <td>Action|Sci-Fi|Thriller</td>\n",
       "      <td>562</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Inception</td>\n",
       "      <td>Action|Crime|Drama|Mystery|Sci-Fi|Thriller|IMAX</td>\n",
       "      <td>508</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Shawshank Redemption The</td>\n",
       "      <td>Crime|Drama</td>\n",
       "      <td>492</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Dark Knight The</td>\n",
       "      <td>Action|Crime|Drama|IMAX</td>\n",
       "      <td>467</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Lord of the RingsThe Return of the King The</td>\n",
       "      <td>Action|Adventure|Drama|Fantasy</td>\n",
       "      <td>459</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                         title  \\\n",
       "0                                   Matrix The   \n",
       "1                                    Inception   \n",
       "2                     Shawshank Redemption The   \n",
       "3                              Dark Knight The   \n",
       "4  Lord of the RingsThe Return of the King The   \n",
       "\n",
       "                                            genres  common_users  \n",
       "0                           Action|Sci-Fi|Thriller           562  \n",
       "1  Action|Crime|Drama|Mystery|Sci-Fi|Thriller|IMAX           508  \n",
       "2                                      Crime|Drama           492  \n",
       "3                          Action|Crime|Drama|IMAX           467  \n",
       "4                   Action|Adventure|Drama|Fantasy           459  "
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def get_similar_movies(title, min_rating=5):\n",
    "    \"\"\"\n",
    "    Retourne les films similaires basés sur les utilisateurs ayant noté les deux films avec une note minimale.\n",
    "\n",
    "    Args:\n",
    "        title (str): Le titre du film pour lequel on veut trouver des films similaires.\n",
    "        min_rating (int): La note minimale que les utilisateurs doivent avoir donnée pour être considérés.\n",
    "\n",
    "    Returns:\n",
    "        pd.DataFrame: Liste des films similaires avec le nombre d'utilisateurs en commun.\n",
    "    \"\"\"\n",
    "    \n",
    "    query = '''\n",
    "    MATCH (m1:Movie)-[r1:RATED]-(u:User)-[r2:RATED]-(m2:Movie)\n",
    "    WHERE m1.title = $title\n",
    "      AND m2.title <> $title\n",
    "      AND r1.rating >= $min_rating \n",
    "      AND r2.rating >= $min_rating\n",
    "    RETURN m2.title AS title, m2.genres AS genres, count(DISTINCT u) AS common_users\n",
    "    ORDER BY common_users DESC\n",
    "    '''\n",
    "\n",
    "    result = gds.run_cypher(query, params={'title': title, 'min_rating': min_rating})\n",
    "    return result\n",
    "\n",
    "\n",
    "similar_movies = get_similar_movies('I Am Legend')\n",
    "similar_movies.head()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "270c02f4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>title</th>\n",
       "      <th>genres</th>\n",
       "      <th>common_users</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Matrix The</td>\n",
       "      <td>Action|Sci-Fi|Thriller</td>\n",
       "      <td>4311</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Shawshank Redemption The</td>\n",
       "      <td>Crime|Drama</td>\n",
       "      <td>3878</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Dark Knight The</td>\n",
       "      <td>Action|Crime|Drama|IMAX</td>\n",
       "      <td>3837</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Lord of the RingsThe Fellowship of the Ring The</td>\n",
       "      <td>Adventure|Fantasy</td>\n",
       "      <td>3702</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Lord of the RingsThe Return of the King The</td>\n",
       "      <td>Action|Adventure|Drama|Fantasy</td>\n",
       "      <td>3681</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                             title  \\\n",
       "0                                       Matrix The   \n",
       "1                         Shawshank Redemption The   \n",
       "2                                  Dark Knight The   \n",
       "3  Lord of the RingsThe Fellowship of the Ring The   \n",
       "4      Lord of the RingsThe Return of the King The   \n",
       "\n",
       "                           genres  common_users  \n",
       "0          Action|Sci-Fi|Thriller          4311  \n",
       "1                     Crime|Drama          3878  \n",
       "2         Action|Crime|Drama|IMAX          3837  \n",
       "3               Adventure|Fantasy          3702  \n",
       "4  Action|Adventure|Drama|Fantasy          3681  "
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def get_similar_movies(gds, title, min_rating=5):\n",
    "    \"\"\"\n",
    "    Récupère la liste des films similaires à un film donné en fonction des utilisateurs\n",
    "    ayant attribué une note égale ou supérieure à la note minimale spécifiée.\n",
    "\n",
    "    Cette fonction utilise une requête Cypher pour identifier les films qui sont connectés\n",
    "    par des utilisateurs ayant attribué une note >= min_rating à la fois au film cible\n",
    "    et aux autres films. Les résultats sont triés par le nombre d'utilisateurs communs.\n",
    "\n",
    "    Args:\n",
    "        gds (GraphDataScience): L'instance de connexion au serveur Neo4j via GraphDataScience.\n",
    "        title (str): Le titre exact du film pour lequel rechercher des films similaires.\n",
    "        min_rating (int, optional): La note minimale que les utilisateurs doivent avoir attribuée pour que le film soit considéré comme similaire. Par défaut à 5.\n",
    "\n",
    "    Returns:\n",
    "        pd.DataFrame: Un DataFrame contenant :\n",
    "            - title (str): Le titre des films similaires.\n",
    "            - genres (str): Le ou les genres des films similaires.\n",
    "            - common_users (int): Le nombre d'utilisateurs en commun ayant donné une note >= min_rating aux deux films.\n",
    "    \"\"\"\n",
    "\n",
    "    query = '''\n",
    "    MATCH (m1:Movie)-[r1:RATED]-(u:User)-[r2:RATED]-(m2:Movie)\n",
    "    WHERE m1.title = $title\n",
    "      AND m2.title <> $title\n",
    "      AND r1.rating >= $min_rating\n",
    "      AND r2.rating >= $min_rating\n",
    "    RETURN m2.title AS title, m2.genres AS genres, count(DISTINCT u) AS common_users\n",
    "    ORDER BY common_users DESC\n",
    "    '''\n",
    "    \n",
    "    result = gds.run_cypher(query, params={'title': title, 'min_rating': min_rating})\n",
    "    return result\n",
    "\n",
    "\n",
    "similar_movies = get_similar_movies(gds, \"I Am Legend\", min_rating=4)\n",
    "similar_movies.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2856a623",
   "metadata": {},
   "outputs": [],
   "source": [
    "gds.run_cypher(\"CALL gds.graph.drop('myGraph', false)\")\n",
    "\n",
    "create_projection = gds.run_cypher('''\n",
    "CALL gds.graph.project(\n",
    "  'myGraph',\n",
    "  ['User', 'Movie'],\n",
    "  {\n",
    "    RATED: {\n",
    "      properties: 'rating'\n",
    "    }\n",
    "  }\n",
    ");\n",
    "''')\n",
    "\n",
    "create_projection.head()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "5055e868",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nodeQuery</th>\n",
       "      <th>relationshipQuery</th>\n",
       "      <th>graphName</th>\n",
       "      <th>nodeCount</th>\n",
       "      <th>relationshipCount</th>\n",
       "      <th>projectMillis</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>MATCH (u:User)\\n  WHERE COUNT { (u)-[:RATED]-&gt;...</td>\n",
       "      <td>MATCH (u1:User)-[r:RATED]-&gt;(m:Movie)\\n  RETURN...</td>\n",
       "      <td>myGraphFiltered</td>\n",
       "      <td>436</td>\n",
       "      <td>0</td>\n",
       "      <td>6448</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                           nodeQuery  \\\n",
       "0  MATCH (u:User)\\n  WHERE COUNT { (u)-[:RATED]->...   \n",
       "\n",
       "                                   relationshipQuery        graphName  \\\n",
       "0  MATCH (u1:User)-[r:RATED]->(m:Movie)\\n  RETURN...  myGraphFiltered   \n",
       "\n",
       "   nodeCount  relationshipCount  projectMillis  \n",
       "0        436                  0           6448  "
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gds.run_cypher(\"CALL gds.graph.drop('myGraphFiltered', false)\")\n",
    "\n",
    "create_projection = gds.run_cypher('''\n",
    "CALL gds.graph.project.cypher(\n",
    "  'myGraphFiltered',\n",
    "  '\n",
    "  MATCH (u:User)\n",
    "  WHERE COUNT { (u)-[:RATED]->() } >= 2000\n",
    "  RETURN id(u) AS id\n",
    "  ',\n",
    "  '\n",
    "  MATCH (u1:User)-[r:RATED]->(m:Movie)\n",
    "  RETURN id(u1) AS source, id(m) AS target, r.rating AS rating\n",
    "  ',\n",
    "  {validateRelationships: false}\n",
    ")\n",
    "''')\n",
    "\n",
    "create_projection.head()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6d1c2b99",
   "metadata": {},
   "outputs": [],
   "source": [
    "# MATCH (u:User {id: 1})-[:RATED]->(m1:Movie)\n",
    "# WITH collect(DISTINCT m1.genres) AS genres_list\n",
    "# UNWIND genres_list AS genre\n",
    "# MATCH (m2:Movie)\n",
    "# WHERE genre IN m2.genres AND NOT EXISTS {\n",
    "#     MATCH (:User {id: 1})-[:RATED]->(m2)\n",
    "# }\n",
    "# RETURN m2.title, m2.genres\n",
    "# LIMIT 5\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "397b6e54",
   "metadata": {},
   "outputs": [
    {
     "ename": "ClientError",
     "evalue": "{code: Neo.ClientError.Procedure.ProcedureCallFailed} {message: Failed to invoke procedure `gds.nodeSimilarity.stream`: Caused by: java.lang.IllegalStateException: Memory required to run Node Similarity (97808b) exceeds available memory (-85895359152b)}",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mClientError\u001b[0m                               Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[25], line 1\u001b[0m\n\u001b[0;32m----> 1\u001b[0m users_similarity \u001b[38;5;241m=\u001b[39m gds\u001b[38;5;241m.\u001b[39mrun_cypher(\u001b[38;5;124m'''\u001b[39m\n\u001b[1;32m      2\u001b[0m \u001b[38;5;124mCALL gds.nodeSimilarity.stream(\u001b[39m\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mmyGraphFiltered\u001b[39m\u001b[38;5;124m'\u001b[39m\u001b[38;5;124m, \u001b[39m\u001b[38;5;124m{\u001b[39m\n\u001b[1;32m      3\u001b[0m \u001b[38;5;124m  topK: 5,\u001b[39m\n\u001b[1;32m      4\u001b[0m \u001b[38;5;124m  similarityCutoff: 0.6\u001b[39m\n\u001b[1;32m      5\u001b[0m \u001b[38;5;124m})\u001b[39m\n\u001b[1;32m      6\u001b[0m \u001b[38;5;124mYIELD node1, node2, similarity\u001b[39m\n\u001b[1;32m      7\u001b[0m \u001b[38;5;124mRETURN \u001b[39m\n\u001b[1;32m      8\u001b[0m \u001b[38;5;124m  gds.util.asNode(node1).id AS UserID1,\u001b[39m\n\u001b[1;32m      9\u001b[0m \u001b[38;5;124m  gds.util.asNode(node2).id AS UserID2,\u001b[39m\n\u001b[1;32m     10\u001b[0m \u001b[38;5;124m  similarity\u001b[39m\n\u001b[1;32m     11\u001b[0m \u001b[38;5;124mORDER BY similarity DESCENDING, UserID1, UserID2\u001b[39m\n\u001b[1;32m     12\u001b[0m \u001b[38;5;124mLIMIT 50\u001b[39m\n\u001b[1;32m     13\u001b[0m \u001b[38;5;124m'''\u001b[39m)\n\u001b[1;32m     15\u001b[0m users_similarity\u001b[38;5;241m.\u001b[39mhead()\n",
      "File \u001b[0;32m/opt/anaconda3/lib/python3.12/site-packages/graphdatascience/graph_data_science.py:214\u001b[0m, in \u001b[0;36mGraphDataScience.run_cypher\u001b[0;34m(self, query, params, database)\u001b[0m\n\u001b[1;32m    211\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28misinstance\u001b[39m(\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_query_runner, ArrowQueryRunner):\n\u001b[1;32m    212\u001b[0m     qr \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_query_runner\u001b[38;5;241m.\u001b[39mfallback_query_runner()\n\u001b[0;32m--> 214\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m qr\u001b[38;5;241m.\u001b[39mrun_cypher(query, params, database, \u001b[38;5;28;01mFalse\u001b[39;00m)\n",
      "File \u001b[0;32m/opt/anaconda3/lib/python3.12/site-packages/graphdatascience/query_runner/neo4j_query_runner.py:177\u001b[0m, in \u001b[0;36mNeo4jQueryRunner.run_cypher\u001b[0;34m(self, query, params, database, custom_error, connectivity_retry_config)\u001b[0m\n\u001b[1;32m    170\u001b[0m \u001b[38;5;66;03m# Though pandas support may be experimental in the `neo4j` package, it should always\u001b[39;00m\n\u001b[1;32m    171\u001b[0m \u001b[38;5;66;03m# be supported in the `graphdatascience` package.\u001b[39;00m\n\u001b[1;32m    172\u001b[0m warnings\u001b[38;5;241m.\u001b[39mfilterwarnings(\n\u001b[1;32m    173\u001b[0m     \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mignore\u001b[39m\u001b[38;5;124m\"\u001b[39m,\n\u001b[1;32m    174\u001b[0m     message\u001b[38;5;241m=\u001b[39m\u001b[38;5;124mr\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m^pandas support is experimental and might be changed or removed in future versions$\u001b[39m\u001b[38;5;124m\"\u001b[39m,\n\u001b[1;32m    175\u001b[0m )\n\u001b[0;32m--> 177\u001b[0m df \u001b[38;5;241m=\u001b[39m result\u001b[38;5;241m.\u001b[39mto_df()\n\u001b[1;32m    179\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_NEO4J_DRIVER_VERSION \u001b[38;5;241m<\u001b[39m SemanticVersion(\u001b[38;5;241m5\u001b[39m, \u001b[38;5;241m0\u001b[39m, \u001b[38;5;241m0\u001b[39m):\n\u001b[1;32m    180\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_last_bookmarks \u001b[38;5;241m=\u001b[39m [session\u001b[38;5;241m.\u001b[39mlast_bookmark()]\n",
      "File \u001b[0;32m/opt/anaconda3/lib/python3.12/site-packages/neo4j/_sync/work/result.py:905\u001b[0m, in \u001b[0;36mResult.to_df\u001b[0;34m(self, expand, parse_dates)\u001b[0m\n\u001b[1;32m    902\u001b[0m \u001b[38;5;28;01mimport\u001b[39;00m \u001b[38;5;21;01mpytz\u001b[39;00m\n\u001b[1;32m    904\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m expand:\n\u001b[0;32m--> 905\u001b[0m     df \u001b[38;5;241m=\u001b[39m pd\u001b[38;5;241m.\u001b[39mDataFrame(\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mvalues(), columns\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_keys)\n\u001b[1;32m    906\u001b[0m \u001b[38;5;28;01melse\u001b[39;00m:\n\u001b[1;32m    907\u001b[0m     df_keys \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;01mNone\u001b[39;00m\n",
      "File \u001b[0;32m/opt/anaconda3/lib/python3.12/site-packages/neo4j/_sync/work/result.py:752\u001b[0m, in \u001b[0;36mResult.values\u001b[0;34m(self, *keys)\u001b[0m\n\u001b[1;32m    733\u001b[0m \u001b[38;5;129m@NonConcurrentMethodChecker\u001b[39m\u001b[38;5;241m.\u001b[39m_non_concurrent_method\n\u001b[1;32m    734\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mvalues\u001b[39m(\u001b[38;5;28mself\u001b[39m, \u001b[38;5;241m*\u001b[39mkeys: _TResultKey) \u001b[38;5;241m-\u001b[39m\u001b[38;5;241m>\u001b[39m \u001b[38;5;28mlist\u001b[39m[\u001b[38;5;28mlist\u001b[39m[t\u001b[38;5;241m.\u001b[39mAny]]:\n\u001b[1;32m    735\u001b[0m \u001b[38;5;250m    \u001b[39m\u001b[38;5;124;03m\"\"\"\u001b[39;00m\n\u001b[1;32m    736\u001b[0m \u001b[38;5;124;03m    Return the remainder of the result as a list of values lists.\u001b[39;00m\n\u001b[1;32m    737\u001b[0m \n\u001b[0;32m   (...)\u001b[0m\n\u001b[1;32m    750\u001b[0m \u001b[38;5;124;03m        Can raise :exc:`.ResultConsumedError`.\u001b[39;00m\n\u001b[1;32m    751\u001b[0m \u001b[38;5;124;03m    \"\"\"\u001b[39;00m\n\u001b[0;32m--> 752\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m [record\u001b[38;5;241m.\u001b[39mvalues(\u001b[38;5;241m*\u001b[39mkeys) \u001b[38;5;28;01mfor\u001b[39;00m record \u001b[38;5;129;01min\u001b[39;00m \u001b[38;5;28mself\u001b[39m]\n",
      "File \u001b[0;32m/opt/anaconda3/lib/python3.12/site-packages/neo4j/_sync/work/result.py:398\u001b[0m, in \u001b[0;36mResult.__iter__\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    396\u001b[0m     \u001b[38;5;28;01myield\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_record_buffer\u001b[38;5;241m.\u001b[39mpopleft()\n\u001b[1;32m    397\u001b[0m \u001b[38;5;28;01melif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_streaming:\n\u001b[0;32m--> 398\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_connection\u001b[38;5;241m.\u001b[39mfetch_message()\n\u001b[1;32m    399\u001b[0m \u001b[38;5;28;01melif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_discarding:\n\u001b[1;32m    400\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_discard()\n",
      "File \u001b[0;32m/opt/anaconda3/lib/python3.12/site-packages/neo4j/_sync/io/_common.py:184\u001b[0m, in \u001b[0;36mConnectionErrorHandler.__getattr__.<locals>.outer.<locals>.inner\u001b[0;34m(*args, **kwargs)\u001b[0m\n\u001b[1;32m    182\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21minner\u001b[39m(\u001b[38;5;241m*\u001b[39margs, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs):\n\u001b[1;32m    183\u001b[0m     \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m--> 184\u001b[0m         func(\u001b[38;5;241m*\u001b[39margs, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs)\n\u001b[1;32m    185\u001b[0m     \u001b[38;5;28;01mexcept\u001b[39;00m (Neo4jError, ServiceUnavailable, SessionExpired) \u001b[38;5;28;01mas\u001b[39;00m exc:\n\u001b[1;32m    186\u001b[0m         \u001b[38;5;28;01massert\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m asyncio\u001b[38;5;241m.\u001b[39miscoroutinefunction(\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m__on_error)\n",
      "File \u001b[0;32m/opt/anaconda3/lib/python3.12/site-packages/neo4j/_sync/io/_bolt.py:864\u001b[0m, in \u001b[0;36mBolt.fetch_message\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    860\u001b[0m \u001b[38;5;66;03m# Receive exactly one message\u001b[39;00m\n\u001b[1;32m    861\u001b[0m tag, fields \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39minbox\u001b[38;5;241m.\u001b[39mpop(\n\u001b[1;32m    862\u001b[0m     hydration_hooks\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mresponses[\u001b[38;5;241m0\u001b[39m]\u001b[38;5;241m.\u001b[39mhydration_hooks\n\u001b[1;32m    863\u001b[0m )\n\u001b[0;32m--> 864\u001b[0m res \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_process_message(tag, fields)\n\u001b[1;32m    865\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39midle_since \u001b[38;5;241m=\u001b[39m monotonic()\n\u001b[1;32m    866\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m res\n",
      "File \u001b[0;32m/opt/anaconda3/lib/python3.12/site-packages/neo4j/_sync/io/_bolt5.py:1208\u001b[0m, in \u001b[0;36mBolt5x7._process_message\u001b[0;34m(self, tag, fields)\u001b[0m\n\u001b[1;32m   1206\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_enrich_error_diagnostic_record(summary_metadata)\n\u001b[1;32m   1207\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m-> 1208\u001b[0m     response\u001b[38;5;241m.\u001b[39mon_failure(summary_metadata \u001b[38;5;129;01mor\u001b[39;00m {})\n\u001b[1;32m   1209\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m (ServiceUnavailable, DatabaseUnavailable):\n\u001b[1;32m   1210\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mpool:\n",
      "File \u001b[0;32m/opt/anaconda3/lib/python3.12/site-packages/neo4j/_sync/io/_common.py:254\u001b[0m, in \u001b[0;36mResponse.on_failure\u001b[0;34m(self, metadata)\u001b[0m\n\u001b[1;32m    252\u001b[0m handler \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mhandlers\u001b[38;5;241m.\u001b[39mget(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mon_summary\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[1;32m    253\u001b[0m Util\u001b[38;5;241m.\u001b[39mcallback(handler)\n\u001b[0;32m--> 254\u001b[0m \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_hydrate_error(metadata)\n",
      "\u001b[0;31mClientError\u001b[0m: {code: Neo.ClientError.Procedure.ProcedureCallFailed} {message: Failed to invoke procedure `gds.nodeSimilarity.stream`: Caused by: java.lang.IllegalStateException: Memory required to run Node Similarity (97808b) exceeds available memory (-85895359152b)}"
     ]
    }
   ],
   "source": [
    "users_similarity = gds.run_cypher('''\n",
    "CALL gds.nodeSimilarity.stream('myGraphFiltered', {\n",
    "  topK: 5,\n",
    "  similarityCutoff: 0.6\n",
    "})\n",
    "YIELD node1, node2, similarity\n",
    "RETURN \n",
    "  gds.util.asNode(node1).id AS UserID1,\n",
    "  gds.util.asNode(node2).id AS UserID2,\n",
    "  similarity\n",
    "ORDER BY similarity DESCENDING, UserID1, UserID2\n",
    "LIMIT 50\n",
    "''')\n",
    "\n",
    "users_similarity.head()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "a64732f7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1\n",
      "2\n",
      "3\n",
      "4\n",
      "5\n",
      "6\n",
      "7\n",
      "8\n",
      "9\n",
      "10\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/opt/anaconda3/lib/python3.12/site-packages/numpy/core/fromnumeric.py:59: FutureWarning: 'DataFrame.swapaxes' is deprecated and will be removed in a future version. Please use 'DataFrame.transpose' instead.\n",
      "  return bound(*args, **kwds)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>create_rated</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   create_rated\n",
       "0             0"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Create Similar relationship\n",
    "i=1\n",
    "for chunk in np.array_split(users_similarity.query('UserID1>UserID2'),10):\n",
    "  print(i)\n",
    "  create_similar = gds.run_cypher('''\n",
    "    unwind $data as row\n",
    "    match (u1:User{id: row.UserID1}), (u2:User{id: row.UserID2})\n",
    "    merge (u1)-[r:SIMILAR]->(u2)\n",
    "    set r.Similarity=row.similarity\n",
    "    return count(*) as create_rated\n",
    "    ''', params = {'data': chunk.to_dict('records')})\n",
    "  i = i+1\n",
    "create_similar.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "11d4949d",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Check similar movies\n",
    "similar_movies_for_user = gds.run_cypher('''\n",
    "    MATCH (u1:User)-[r1:SIMILAR]-(u2)-[r2:RATED]-(m:Movie)\n",
    "    WHERE id(u1)=$id\n",
    "    AND NOT ( (u1)-[]-(m))\n",
    "    RETURN m.Title,m.Genres,Sum(r1.Similarity*r2.Rating)/sum(r1.Similarity)+log(count(r2)) as score\n",
    "    ORDER BY score DESC\n",
    "''',params = {'id':4725})\n",
    "similar_movies_for_user.head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "799c9cbb",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Check actual movies\n",
    "movies_for_user = gds.run_cypher('''\n",
    "    MATCH (u1:User)-[r:RATED]-(m:Movie)\n",
    "  WHERE id(u1)=$id\n",
    "  RETURN m.Title,m.Genres,r.Rating as rating\n",
    "  ORDER BY rating DESC\n",
    "''',params = {'id':4725})\n",
    "movies_for_user.head(10)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
